Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/rx_clock_power_init.c
static const char* s_tag = "CLOCK_INIT";

/* =============================================================================
 * Private Definitions
 * =============================================================================
 */

/** @brief Oscillator stabilization timing constants */
typedef enum : uint32_t {
  k_main_osc_stabilization_cycles     = 2400000, /**< Main oscillator delay (~10ms at 240MHz) */
  k_pll_stabilization_timeout         = 1000000, /**< PLL stabilization max wait iterations */
  k_pll_stabilization_timeout_expired = 0,       /**< PLL timeout expiration value */
} oscillator_timing_t;

/** @brief Oscillator control register values */
typedef enum : uint8_t {
  k_sub_clock_stopped = 0x01, /**< SOSCCR: Stop sub-clock oscillator */
  k_main_osc_enabled  = 0x00, /**< MOSCCR: Enable main oscillator */
  k_pll_enabled       = 0x00, /**< PLLCR2: Enable PLL */
} oscillator_control_t;

/** @brief PLL configuration values */
typedef enum : uint16_t {
  k_pll_multiplier_10_div_1 = 0x1300, /**< PLLCR: 10x multiplier, divide by 1 (240MHz from 24MHz) */
  k_pll_stable_flag         = 0x04,   /**< OSCOVFSR: PLL stabilization flag bit */
} pll_config_t;

/** @brief System clock configuration */
typedef enum : uint32_t {
  k_system_clock_dividers   = 0x21C21211, /**< SCKCR: ICLK=240MHz, PCLKA=120MHz, others=60MHz */
  k_system_clock_source_pll = 0x0400,     /**< SCKCR3: Select PLL as system clock source */
} system_clock_config_t;

/** @brief Module stop bit positions in MSTPCRA */
typedef enum : uint8_t {
  k_mstpcra_cmt = 15, /**< CMT0, CMT1 module stop bit */
  k_mstpcra_mtu = 9,  /**< MTU module stop bit */
} mstpcra_bits_t;

/** @brief Module stop bit positions in MSTPCRB */
typedef enum : uint8_t {
  k_mstpcrb_rspi0 = 17, /**< RSPI0 module stop bit */
  k_mstpcrb_rspi1 = 16, /**< RSPI1 module stop bit */
  /* Note: SCI modules are enabled per-channel in uart_init_channel() */
} mstpcrb_bits_t;

/** @brief Module stop bit positions in MSTPCRC */
typedef enum : uint8_t {
  k_mstpcrc_s12ad = 17, /**< S12AD module stop bit */
} mstpcrc_bits_t;

/** @brief Module initialization retry configuration */
typedef enum : uint8_t {
  k_retry_count_module_stop = 3, /**< Number of retries for module stop register verification */
} module_init_config_t;

/* =============================================================================
 * Clock Configuration
 * =============================================================================
 */

/**
 * @brief Initialize clock system to 240 MHz
 *
 * Clock tree:
 * - Main oscillator: 24 MHz (external crystal)
 * - PLL: 24 MHz x 10 / 1 = 240 MHz
 * - ICLK (CPU): 240 MHz
 * - PCLKA: 120 MHz
 * - PCLKB/C/D: 60 MHz
 * - FCLK (Flash): 60 MHz
 *
 * @return k_rx_ok on success
 */
static rx_err_t internal_clock_init(void)
{
  /* Unlock protection for clock registers */
  *prcr_reg() = k_rx_prcr_unlock_all;
  /* Precondition: Verify PRCR unlock took effect
   * Note: PRCR key byte (upper 8 bits) reads back as 0x00, so we must mask it */
  uint32_t timeout = k_pll_stabilization_timeout;

  RX_ASSERT((*prcr_reg() & k_rx_prcr_readback_mask) ==
              (k_rx_prcr_unlock_all & k_rx_prcr_readback_mask),
            "Precondition: PRCR unlock failed");

  /* Stop sub-clock oscillator (not used) */
  system_regs()->sosccr = k_sub_clock_stopped;

  /* Disable RTC to fully disable sub-clock (RCR3.RTCEN = 0)
   * Required for complete sub-clock shutdown as per hardware manual
   * NOTE: Uses direct accessor rtc_rcr3_reg() at correct address 0x0008C426
   * Previous struct-based access had wrong offset (0x1A instead of 0x26) */
  *rtc_rcr3_reg() = k_rcr3_rtcen_disable;

  /* Start main oscillator (24 MHz external crystal) */
  system_regs()->mosccr = k_main_osc_enabled;

  /* Wait for main oscillator stabilization (typically 10ms) */
  /* NOTE: Busy-wait required - runs before ThreadX initialization */
#if RX_IS_SIMULATOR
  /* Simulator: Oscillator stable immediately (no external crystal to stabilize) */
#else
  /* Hardware: Wait ~10ms for 24 MHz external crystal to stabilize */
  for (volatile uint32_t i = 0; i < k_main_osc_stabilization_cycles; i++) {
    __asm__ volatile("nop");
  }
#endif

  /* Configure PLL */
  /* PLL = (Main OSC x PLIDIV) / PLLSTBY */
  /* 240 MHz = (24 MHz x 10) / 1 */
  system_regs()->pllcr  = k_pll_multiplier_10_div_1;
  system_regs()->pllcr2 = k_pll_enabled;

  /* Wait for PLL stabilization */
  /* NOTE: Busy-wait polling required - runs before ThreadX initialization */
#if RX_IS_SIMULATOR
  /* Simulator: PLL stable immediately (no hardware PLL circuit to lock) */
#else
  /* Hardware: Poll OSCOVFSR until PLL locks (typically ~200 µs) */
  while ((system_regs()->oscovfsr & k_pll_stable_flag) == 0 && timeout > 0) {
    timeout--;
  }

  if (timeout == k_pll_stabilization_timeout_expired) {
    /* PLL failed to stabilize - but can't log yet (UART not initialized) */
    *prcr_reg() = k_rx_prcr_lock;
    return k_rx_err_hw_timeout;
  }
#endif

  /* =========================================================================
   * Configure PPLL for USB Clock (UCLK = 48 MHz)
   * =========================================================================
   * Per RX72N manual Ch09:
   * - USB requires UCLK = 48 MHz (exact)
   * - PPLL generates USB clock from main oscillator
   * - Configuration: 48 MHz = (24 MHz × 8) / 4
   */

  /* Configure PPLL for 48 MHz USB clock */
  *ppllcr_reg()  = k_ppll_config_48mhz;
  *ppllcr2_reg() = k_ppll_enabled;

  /* Wait for PPLL stabilization */
#if RX_IS_SIMULATOR
  /* Simulator: PPLL stable immediately (no hardware PPLL circuit to lock) */
#else
  /* Hardware: Poll OSCOVFSR until PPLL locks (typically ~200 µs) */
  timeout = k_pll_stabilization_timeout;
  while ((system_regs()->oscovfsr & k_ppll_stable_flag) == 0 && timeout > 0) {
    timeout--;
  }

  if (timeout == k_pll_stabilization_timeout_expired) {
    /* PPLL failed to stabilize */
    *prcr_reg() = k_rx_prcr_lock;
    return k_rx_err_hw_timeout;
  }

