Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/rx_clock_power_init.c
  /* Post-condition: Verify PPLL is stable (NASA Rule 5) */
  RX_ASSERT((system_regs()->oscovfsr & k_ppll_stable_flag) != 0,
            "Postcondition: PPLL stabilization verification failed");
#endif

  /* =========================================================================
   * CRITICAL: Configure MEMWAIT for ICLK > 120 MHz
   * =========================================================================
   * Per RX72N manual Ch09 section 9.2.2, page 341, line 962:
   * "Set the MEMWAIT to 1 (one wait cycle) if the ICLK frequency is to be
   * above 120 MHz."
   *
   * MUST be set BEFORE changing SCKCR to 240 MHz.
   *
   * Manual lines 986-989: "To change the frequency of the ICLK from 120 MHz
   * or less to above 120 MHz, start by setting the MEMWAIT bit to 1 (one
   * wait cycle), and then change the frequency setting in the SCKCR register."
   */

  /* Set MEMWAIT = 1 for 240 MHz operation */
  *memwait_reg() = k_memwait_one_wait;

  /* Pre-condition: Verify MEMWAIT was set correctly (NASA Rule 5) */
  RX_ASSERT(*memwait_reg() == k_memwait_one_wait, "Precondition: MEMWAIT configuration failed");

  /* Configure system clocks */
  /* ICLK=240MHz, PCLKA=120MHz, PCLKB=60MHz, PCLKC=60MHz,
     * PCLKD=60MHz, BCLK=120MHz, FCLK=60MHz */
  system_regs()->sckcr = k_system_clock_dividers;

  /* Post-condition: Verify MEMWAIT remains set after clock change (NASA Rule 5) */
  RX_ASSERT(*memwait_reg() == k_memwait_one_wait,
            "Postcondition: MEMWAIT corrupted after clock switch");

  /* Select PLL as system clock */
  system_regs()->sckcr3 = k_system_clock_source_pll;

  /* Postcondition: Verify PLL selection took effect */
#if !RX_IS_SIMULATOR
  /* Hardware: Verify PLL selected and stable */
  RX_ASSERT((system_regs()->sckcr3 == k_system_clock_source_pll) &&
              ((system_regs()->oscovfsr & k_pll_stable_flag) != 0),
            "Postcondition: PLL selection and stability verification failed");
#else
  /* Simulator: Verify PLL selected (skip stability check - not modeled in simulator) */
  RX_ASSERT(system_regs()->sckcr3 == k_system_clock_source_pll,
            "Postcondition: PLL selection verified (simulator mode)");
#endif

  /* Lock protection */
  *prcr_reg() = k_rx_prcr_lock;

  return k_rx_ok;
}

/* =============================================================================
 * Module Stop Control
 * =============================================================================
 */

/**
 * @brief Enable peripheral modules
 *
 * Disables module stop for peripherals we'll use:
 * - CMT0 (system tick timer)
 * - MTU (motor PWM)
 * - S12AD (ADC)
 *
 * Note: SCI modules are enabled per-channel in uart_init_channel()
 *
 * @return k_rx_ok on success, k_rx_err if verification fails after retries
 */
static rx_err_t internal_module_stop_init(void)
{
  const uint32_t mstpcra_clear_mask = (1UL << k_mstpcra_cmt) | (1UL << k_mstpcra_mtu);
  const uint32_t mstpcrb_clear_mask = (1UL << k_mstpcrb_rspi0) | (1UL << k_mstpcrb_rspi1);
  const uint32_t mstpcrc_clear_mask = (1UL << k_mstpcrc_s12ad);
  for (uint8_t attempt = 0; attempt < k_retry_count_module_stop; attempt++) {
    /* Protect off */
    *prcr_reg() = k_rx_prcr_unlock_all;
    /* Module Stop Control Register A */
    system_regs()->mstpcra &= ~mstpcra_clear_mask; /* CMT0, CMT1, MTU */
    /* Module Stop Control Register B */
    /* Note: SCI modules are enabled per-channel in uart_init_channel() */
    system_regs()->mstpcrb &= ~mstpcrb_clear_mask; /* RSPI0, RSPI1 */
    /* Module Stop Control Register C */
    system_regs()->mstpcrc &= ~mstpcrc_clear_mask; /* S12AD */
    /* Protect on */
    *prcr_reg() = k_rx_prcr_lock;
    /* Post-condition: Verify bits are cleared */
    const uint32_t mstpcra_actual = system_regs()->mstpcra & mstpcra_clear_mask;
    const uint32_t mstpcrb_actual = system_regs()->mstpcrb & mstpcrb_clear_mask;
    const uint32_t mstpcrc_actual = system_regs()->mstpcrc & mstpcrc_clear_mask;
    if ((mstpcra_actual == 0) && (mstpcrb_actual == 0) && (mstpcrc_actual == 0)) {
      /* Postcondition: Re-read hardware registers to verify stability */
      const uint32_t verify_a = system_regs()->mstpcra & mstpcra_clear_mask;
      const uint32_t verify_b = system_regs()->mstpcrb & mstpcrb_clear_mask;
      const uint32_t verify_c = system_regs()->mstpcrc & mstpcrc_clear_mask;
      RX_ASSERT((verify_a == 0) && (verify_b == 0) && (verify_c == 0),
                "Postcondition: Module stop bits remain cleared");
      return k_rx_ok;
    }
    /* If verification failed and this isn't the last attempt, retry */
  }

  /* All retries exhausted - return error */
  return k_rx_err_hw_timeout;
}

/* =============================================================================
 * Public API
 * =============================================================================
 */

/**
 * @brief Verify system clock configuration is correct
 *
 * Checks that the clock system is properly configured to 240 MHz and
 * that required peripheral modules are enabled.
 *
 * @return k_rx_ok if system state is valid, error code otherwise
 */
static rx_err_t internal_verify_system_state(void)
{
  const volatile rx_system_regs_t* sys = system_regs();

  /* Verify system register access */
  RX_CHECK_NULL_PTR(sys, s_tag, "system_regs pointer is nullptr");

  /* Verify PLL is enabled by checking PLLCR2 register */
  uint8_t pllcr2 = sys->pllcr2;
  if (pllcr2 != k_pll_enabled) {
    return k_rx_err_hw_init_failed;
  }

  /* Verify system clock dividers are configured correctly */
  uint32_t sckcr = sys->sckcr;
  if (sckcr != k_system_clock_dividers) {
    return k_rx_err_hw_init_failed;
  }

  /* Verify PLL is selected as the system clock source */
  uint16_t sckcr3 = sys->sckcr3;
  if (sckcr3 != k_system_clock_source_pll) {
    return k_rx_err_hw_init_failed;
  }

  /* Verify PPLL is enabled for USB clock */
  uint8_t ppllcr2 = *ppllcr2_reg();
  if (ppllcr2 != k_ppll_enabled) {
    return k_rx_err_hw_init_failed;
  }

#if !RX_IS_SIMULATOR
  /* Verify PPLL is stable (hardware only - simulator doesn't model OSCOVFSR flags) */
  uint8_t oscovfsr = sys->oscovfsr;
  if ((oscovfsr & k_ppll_stable_flag) == 0) {
    return k_rx_err_hw_init_failed;
  }
#endif

  /* Verify MEMWAIT is configured for 240 MHz operation */
  uint8_t memwait = *memwait_reg();
  if (memwait != k_memwait_one_wait) {
    return k_rx_err_hw_init_failed;
  }

