Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/rx_clock_power_init.c
  /* Postcondition: All clock configuration verified (NASA Rule 5) */
#if !RX_IS_SIMULATOR
  /* Hardware: Verify all clock configuration including PPLL stability */
  RX_ASSERT((pllcr2 == k_pll_enabled) && (sckcr == k_system_clock_dividers) &&
              (sckcr3 == k_system_clock_source_pll) && (ppllcr2 == k_ppll_enabled) &&
              ((oscovfsr & k_ppll_stable_flag) != 0) && (memwait == k_memwait_one_wait),
            "Postcondition: clock configuration verified");
#else
  /* Simulator: Verify clock configuration (skip PPLL stability - not modeled in simulator) */
  RX_ASSERT((pllcr2 == k_pll_enabled) && (sckcr == k_system_clock_dividers) &&
              (sckcr3 == k_system_clock_source_pll) && (ppllcr2 == k_ppll_enabled) &&
              (memwait == k_memwait_one_wait),
            "Postcondition: clock configuration verified (simulator mode)");
#endif

  return k_rx_ok;
}

/**
 * @brief Initialize RX72N system clock and power management - Public entry point
 *
 * @details
 * Configures the **complete clock tree** and **module power control** for the RX72N MCU.
 * This is the **FIRST initialization function** called from main() after reset, before any
 * peripheral setup or RTOS startup.
 *
 * **Call sequence:** Reset -> main() -> rx_clock_power_init() -> hardware_init() -> tx_kernel_enter()
 *
 * ## Three-Phase Initialization
 *
 * ### Phase 1: Clock Configuration (internal_clock_init)
 * - Stop sub-clock oscillator (not used)
 * - Start main oscillator (24 MHz external crystal)
 * - Configure PLL (24 MHz × 10 ÷ 1 = 240 MHz)
 * - Configure PPLL (24 MHz × 8 ÷ 4 = 48 MHz USB clock)
 * - **Set MEMWAIT=1 for ICLK > 120 MHz** (CRITICAL for flash access)
 * - Configure system clock dividers (ICLK=240 MHz, PCLKA=120 MHz, etc.)
 * - Select PLL as system clock source
 * - **Duration:** ~10.5 ms (dominated by oscillator stabilization)
 *
 * ### Phase 2: Module Stop Control (internal_module_stop_init)
 * - Enable CMT0/CMT1 (timers for ThreadX tick)
 * - Enable MTU (PWM for motor control)
 * - Enable RSPI0/RSPI1 (SPI communication)
 * - Enable S12AD (ADC for current/voltage sensing)
 * - Verify all module clocks enabled (retry up to 3 times)
 * - **Duration:** ~5 µs
 *
 * ### Phase 3: Verification (internal_verify_system_state)
 * - Read back all clock configuration registers
 * - Verify PLL enabled and stable
 * - Verify PPLL enabled and stable (USB clock)
 * - Verify system clock dividers correct (SCKCR)
 * - Verify PLL selected as clock source (SCKCR3)
 * - Verify MEMWAIT=1 set correctly
 * - **Duration:** ~2 µs
 *
 * ## Clock Tree Output
 *
 * **After successful initialization:**
 *
 * | Clock | Frequency | Divider | Purpose |
 * |-------|-----------|---------|---------|
 * | **ICLK** | 240 MHz | ÷1 | CPU core execution |
 * | **PCLKA** | 120 MHz | ÷2 | High-speed peripherals (CMT, MTU) |
 * | **PCLKB** | 60 MHz | ÷4 | Medium-speed peripherals (SCI, RSPI, RIIC) |
 * | **PCLKC** | 60 MHz | ÷4 | Low-speed peripherals |
 * | **PCLKD** | 60 MHz | ÷4 | Low-speed peripherals |
 * | **FCLK** | 60 MHz | ÷4 | Flash memory access |
 * | **BCLK** | 120 MHz | ÷2 | External bus (if used) |
 * | **UCLK** | 48 MHz | PPLL | USB communication (exact frequency required) |
 *
 * ## Performance Characteristics (RX72N @ 240 MHz)
 *
 * | Phase | Duration | Blocking? | Notes |
 * |-------|----------|-----------|-------|
 * | **Clock init** | ~10.5 ms | Yes | Main OSC stabilization dominates |
 * | **Module stop** | ~5 µs | No | Register writes only |
 * | **Verification** | ~2 µs | No | Register reads only |
 * | **Total** | **~10.5 ms** | Yes | **Not on critical boot path** |
 *
 * **Boot time context:** Total boot time (reset -> ThreadX) is ~51 ms, dominated by USB
 * enumeration (~50 ms) which happens later in app_main_task. Clock init is only ~20% of boot.
 *
 * ## Error Scenarios and Recovery
 *
 * **Fatal errors (function returns error, main() halts boot):**
 *
 * 1. **PLL stabilization timeout** (k_rx_err_hw_timeout)
 *    - **Cause:** PLL failed to lock within 1M iterations (~4 ms @ 240 MHz)
 *    - **Root causes:** External crystal failure, incorrect PLLCR config, power supply issue
 *    - **Recovery:** Hardware reset required, investigate crystal oscillation
 *
 * 2. **PPLL stabilization timeout** (k_rx_err_hw_timeout)
 *    - **Cause:** PPLL (USB clock) failed to lock within timeout
 *    - **Root causes:** Main oscillator unstable, incorrect PPLLCR config
 *    - **Recovery:** Hardware reset required, verify main oscillator
 *
 * 3. **Module stop verification failed** (k_rx_err_hw_timeout)
 *    - **Cause:** Module stop bits did not clear after 3 retries
 *    - **Root causes:** Register protection stuck, hardware fault, clock gating issue
 *    - **Recovery:** Hardware reset required, check PRCR register
 *
 * 4. **Clock configuration verification failed** (k_rx_err_hw_init_failed)
 *    - **Cause:** Clock registers not set to expected values after initialization
 *    - **Root causes:** Register write failed, hardware fault, corruption during init
 *    - **Recovery:** Hardware reset required, investigate register access
 *
 * ## Critical Timing: MEMWAIT for 240 MHz Operation
 *
 * **From RX72N User's Manual Ch09, Section 9.2.2:**
 *
 * > "Set the MEMWAIT to 1 (one wait cycle) if the ICLK frequency is to be above 120 MHz."
 *
 * **Implementation sequence (CRITICAL ORDER):**
 * ```
 * 1. Set MEMWAIT=1 (add wait state for flash reads)
 * 2. Verify MEMWAIT write took effect (assertion)
 * 3. Configure SCKCR to 240 MHz (now safe to switch)
 * 4. Verify MEMWAIT still =1 after clock switch (assertion)
 * ```
 *
 * **Why this matters:** Flash memory cannot keep up with 240 MHz CPU without wait state.
 * Omitting MEMWAIT=1 causes:
 * - Flash read errors (corrupted instruction fetch)
 * - Data corruption (constants read from flash)
 * - Unpredictable behavior (random crashes, incorrect execution)
 *
 * @return rx_err_t Initialization status
 * @retval k_rx_ok All clocks configured successfully (system ready for peripherals)
 * @retval k_rx_err_hw_timeout PLL or PPLL stabilization timeout (oscillator failure)
 * @retval k_rx_err_hw_timeout Module stop verification failed after 3 retries (register access issue)
 * @retval k_rx_err_hw_init_failed Clock configuration verification failed (register corruption)
 *
 * @pre MCU reset complete (C runtime initialized, BSS cleared)
 * @pre Stack pointer valid (main stack at least 4 KB available)
 * @pre External 24 MHz crystal oscillating (hardware requirement)
 * @pre VCC voltage stable (no brownout conditions)
 *
 * @post System clock running at 240 MHz from PLL (ICLK=240 MHz)
 * @post USB clock running at exactly 48 MHz from PPLL (UCLK=48 MHz)
 * @post Peripheral clocks configured (PCLKA=120 MHz, PCLKB/C/D=60 MHz)
 * @post Flash wait state set (MEMWAIT=1 for safe 240 MHz operation)
 * @post Module clocks enabled (CMT, MTU, RSPI, S12AD ready for use)
 * @post All clock configuration verified (registers read back and validated)
 *
 * @note **Call order:** rx_clock_power_init() MUST be called before hardware_init() or any
 *       peripheral initialization. Peripherals require stable system clocks.
 *
 * @note **Not idempotent:** Calling rx_clock_power_init() multiple times may cause PLL
 *       instability or timing violations. Only call once during boot from main().
 *
 * @note **No logging available:** UART not initialized yet, cannot use rx_log_*() functions.
 *       Errors returned via error code only.
 *
 * @warning **Critical initialization function.** Failure halts boot (no recovery possible).
 *          Investigate hardware (crystal, power supply) if timeout errors occur.
 *
 * @warning **MEMWAIT=1 is MANDATORY for 240 MHz.** Omitting causes flash read errors and
 *          data corruption. Never modify clock init without preserving MEMWAIT sequence.
 *
 * @par Thread Safety:
 * Executes in single-threaded context before ThreadX starts. No synchronization needed.
 *
 * @par Example Usage (from main.c):
 * @code
 * int main(void) {
 *   rx_err_t ret;
 *
 *   // Stage 1: System clocks (240 MHz PLL)
 *   ret = rx_clock_power_init();
 *   RX_ERROR_CHECK(ret);
 *
 *   if (ret != k_rx_ok) {
 *     // Clock init failed - cannot proceed
 *     // (Cannot log error - UART not initialized yet)
 *     while (1) {
 *       __asm__ volatile("wait");  // Halt execution
 *     }
 *   }
 *
 *   // Stage 2: Application peripherals (timers, UART, sensors)
 *   ret = hardware_init();
 *   RX_ERROR_CHECK(ret);
 *
 *   // Stage 3: Start ThreadX RTOS
 *   tx_kernel_enter();
 *
 *   // Never reached
 * }
 * @endcode
 *
 * @par Example Error Handling:
 * @code
 * rx_err_t rx_clock_power_init(void) {
 *   rx_err_t err;
 *
 *   // Phase 1: Configure clocks (240 MHz PLL)
 *   err = internal_clock_init();
 *   if (err != k_rx_ok) {
 *     return err;  // PLL/PPLL timeout, cannot proceed
 *   }
 *
 *   // Phase 2: Enable peripheral module clocks
 *   err = internal_module_stop_init();
 *   if (err != k_rx_ok) {
 *     return err;  // Module stop verification failed
 *   }
 *
 *   // Phase 3: Verify configuration
 *   err = internal_verify_system_state();
 *   if (err != k_rx_ok) {
 *     return err;  // Clock registers not set correctly
 *   }
 *
 *   return k_rx_ok;  // All phases succeeded
 * }
 * @endcode
 *
 * @par Clock Stability Verification:
 * @code
 * // Verify system is running at 240 MHz after init:
 * rx_err_t ret = rx_clock_power_init();
 * if (ret == k_rx_ok) {
 *   // All clocks stable and configured
 *   RX_ASSERT(system_regs()->sckcr3 == k_system_clock_source_pll,
 *             "PLL selected as system clock");
 *   RX_ASSERT(*memwait_reg() == k_memwait_one_wait,
 *             "MEMWAIT set for 240 MHz operation");
 *   RX_ASSERT((system_regs()->oscovfsr & k_pll_stable_flag) != 0,
 *             "PLL stable");
 * }
 * @endcode
 *
 * @see internal_clock_init() Phase 1: Configure PLL to 240 MHz and PPLL to 48 MHz
 * @see internal_module_stop_init() Phase 2: Enable peripheral module clocks
 * @see internal_verify_system_state() Phase 3: Verify all configuration correct
 * @see hardware_init() Called after this function (peripheral initialization)
 * @see main() Entry point that calls this function during boot
 *
 * @since Version 1.0.0
 *
 * @test test_clock_init.c Verify 240 MHz PLL configuration
 * @test test_clock_init.c Verify 48 MHz PPLL configuration (USB clock)
 * @test test_clock_init.c Verify MEMWAIT=1 set before clock switch
 * @test test_clock_init.c Verify module clocks enabled
 * @test test_clock_init.c Verify PLL timeout error handling
 */
rx_err_t rx_clock_power_init(void)
{
  /* Initialize clock to 240 MHz */
  rx_err_t err = internal_clock_init();
  if (err != k_rx_ok) {
    /* Can't log - UART not initialized yet */
    return err;
  }

  /* Enable peripheral modules */
  err = internal_module_stop_init();
  if (err != k_rx_ok) {
    /* Can't log - UART not initialized yet */
    return err;
  }

  /* Postcondition: Verify system state is correctly configured */
  err = internal_verify_system_state();
  if (err != k_rx_ok) {
    /* Clock or module configuration failed validation */
    return err;
  }

  /* System init complete - but still can't log until UART is initialized */

  return k_rx_ok;
}
